; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v1 - type_2 ?v6 - type_1)
 	      (pred_1 ?v8 - object ?v6 - type_1)
	      (pred_2 ?v1 - type_2 ?v5 - type_3)
	      (pred_4 ?v1 - type_2 ?v8 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v1 - type_2 ?v2 ?v7 - type_1)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v7)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_2 ?v4 - object ?v3 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v3) (pred_3 ?v1 ?v3) (pred_2 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v3)) 
		    (not (pred_2 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_2 ?v4 - object ?v3 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v4 ?v5) (pred_3 ?v1 ?v3))
       :effect (and (pred_1 ?v4 ?v3)
		    (pred_2 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v4 ?v5)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_08 obj_02 - type_2
obj_05 obj_03 obj_11 obj_06 - type_3
obj_04 obj_07 obj_01 - type_1
obj_09 obj_10 - object)
(:init
(pred_3 obj_08 obj_04)
(pred_2 obj_08 obj_05)
(pred_2 obj_08 obj_03)
(pred_3 obj_02 obj_04)
(pred_2 obj_02 obj_11)
(pred_2 obj_02 obj_06)
(pred_1 obj_09 obj_04)
(pred_1 obj_10 obj_01)
)
(:goal
(and
(pred_1 obj_09 obj_07)
(pred_1 obj_10 obj_07)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_01)))
)
)

; plan
1. (op_1 obj_08 obj_09 obj_04 obj_03)
   deleted: (pred_1 obj_09 obj_04) (pred_2 obj_08 obj_03)
   added: (pred_4 obj_08 obj_09 obj_03)
   goals met: 0 of 2
2. (op_3 obj_02 obj_04 obj_01)
   deleted: (pred_3 obj_02 obj_04)
   added: (pred_3 obj_02 obj_01)
   goals met: 0 of 2
3. (op_3 obj_08 obj_04 obj_07)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_07)
   goals met: 0 of 2
4. (op_1 obj_02 obj_10 obj_01 obj_06)
   deleted: (pred_1 obj_10 obj_01) (pred_2 obj_02 obj_06)
   added: (pred_4 obj_02 obj_10 obj_06)
   goals met: 0 of 2
5. (op_3 obj_02 obj_01 obj_07)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_07)
   goals met: 0 of 2
6. (op_2 obj_08 obj_09 obj_07 obj_03)
   deleted: (pred_4 obj_08 obj_09 obj_03)
   added: (pred_1 obj_09 obj_07) (pred_2 obj_08 obj_03)
   goals met: 1 of 2
7. (op_2 obj_02 obj_10 obj_07 obj_06)
   deleted: (pred_4 obj_02 obj_10 obj_06)
   added: (pred_1 obj_10 obj_07) (pred_2 obj_02 obj_06)
   goals met: 2 of 2
